// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// let namber = prompt("Введіть число");
// console.log(namber);
// namber = Number(namber);

// if (namber === 10) {
//     alert("Вірно");
    
// } else {
//     alert("Невірно");
// }

// <----------------------------------------------------------------------------------------------> //
    
// let isAdult = confirm("Чи є Вам 18 років?");
// console.log(isAdult);



// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// if (min > 0 && min < 15) {
//   alert(`${min} входить в першу чверть`);
// } else if (min >= 15 && min <= 30) {
//   alert(`${min} входить в другу чверть`);
// } else if (min >= 30 && min <= 45) {
//   alert(`${min} входить в третю чверть`);
// } else {
//   alert(`${min} входить в чотверту чверть`);
// }



// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const number = prompt("Введіть чисто від 1 до 4");

// switch (number) {
//     case "1":
//         console.log("зима");
//         break;
//     case "2":
//         console.log("весна");
//         break;
//     case "3":
//         console.log("літо");
//         break;
//     case "4":
//         console.log("осінь");
//         break;
//     default:
//     console.log("?");
// }



// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// let count = 0;
// while (count <= 20) {
//     console.log(`${count}`);
//     count += 1;
// }



// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// function getNumbers(min, max) {
//     let sum = 0;
//     for (let i = max; i >= min; i--) {
//         console.log(i);
//         if (i % 2 === 0) {
//       sum += i;
//         }
//     }
//         return sum;
// }

// const result = getNumbers(2, 10);
// console.log(result);



// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

function min(a, b) {
    if (typeof a !== "number" || typeof b !== "number") {
        return "Not a number!";
    }
        return a < b ? a : b;
}

console.log(min(20, 15));
console.log(min(7, 'abc'));
